---
kind: method
id: M:Autodesk.Revit.DB.LinkElementId.op_Equality(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.LinkElementId)
source: html/6c6bb496-8d99-6685-4d97-3ec9257610f4.htm
---
# Autodesk.Revit.DB.LinkElementId.op_Equality Method

Determines whether these two LinkElementIds are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	LinkElementId first,
	LinkElementId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.LinkElementId`) - The first LinkElementId.
- **second** (`Autodesk.Revit.DB.LinkElementId`) - The second LinkElementId.

## Returns
True if the LinkElementIds are the same; otherwise, false.